of70/tutorials/rheoMultiRegionFoam/sphere/PTTLog/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform ( 1 0 0 ); 
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type           zeroGradient;   
    }
    
    map.fluid
    {
        type           fixedValue;
        value          uniform ( 0 0 0 );   
    }
    
    "(front|back)"
    {
        type          wedge;
    }
    
}

// ************************************************************************* //
