of70/tutorials/rheoMultiRegionFoam/sphere/PTTLog/0/sphere/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    
    map.sphere
    {   
        type                    coupledT;
        nbrFieldName            "T";
        isContactResistance     true;
        hres                    10;
        value                   uniform 1;
    }
    
    "(front|back)"
    {
        type          wedge;
    }
    
}

// ************************************************************************* //
